; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	thermograph2 - mode
	spectrograph0 - mode
	image1 - mode
	thermograph3 - mode
	Star0 - direction
	Star3 - direction
	GroundStation5 - direction
	GroundStation1 - direction
	Star4 - direction
	Star2 - direction
	Star8 - direction
	GroundStation7 - direction
	Star6 - direction
	Planet9 - direction
	Star10 - direction
	Phenomenon11 - direction
	Star12 - direction
	Phenomenon13 - direction
	Phenomenon14 - direction
	Planet15 - direction
	Star16 - direction
)
(:init
	(supports instrument0 thermograph3)
	(calibration_target instrument0 Star8)
	(calibration_target instrument0 Star4)
	(calibration_target instrument0 GroundStation1)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star16)
	(supports instrument1 thermograph3)
	(calibration_target instrument1 GroundStation7)
	(calibration_target instrument1 Star2)
	(calibration_target instrument1 Star8)
	(supports instrument2 thermograph2)
	(supports instrument2 thermograph3)
	(supports instrument2 image1)
	(calibration_target instrument2 Star2)
	(calibration_target instrument2 GroundStation7)
	(supports instrument3 image1)
	(supports instrument3 thermograph2)
	(supports instrument3 thermograph3)
	(calibration_target instrument3 GroundStation7)
	(calibration_target instrument3 Star8)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star3)
	(supports instrument4 spectrograph0)
	(supports instrument4 thermograph3)
	(calibration_target instrument4 Star6)
	(calibration_target instrument4 GroundStation7)
	(on_board instrument4 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star2)
)
(:goal (and
	(have_image Planet9 thermograph3)
	(have_image Star10 image1)
	(have_image Phenomenon11 spectrograph0)
	(have_image Star12 image1)
	(have_image Phenomenon13 image1)
	(have_image Phenomenon14 spectrograph0)
	(have_image Planet15 spectrograph0)
	(have_image Star16 image1)
))

)

; plan
1. (turn_to satellite2 groundstation7 star2)
   deleted: (pointing satellite2 star2)
   added: (pointing satellite2 groundstation7)
   goals met: 0 of 8
2. (switch_on instrument4 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument4)
   goals met: 0 of 8
3. (calibrate satellite2 instrument4 groundstation7)
   added: (calibrated instrument4)
   goals met: 0 of 8
4. (turn_to satellite2 phenomenon11 groundstation7)
   deleted: (pointing satellite2 groundstation7)
   added: (pointing satellite2 phenomenon11)
   goals met: 0 of 8
5. (turn_to satellite1 groundstation7 star3)
   deleted: (pointing satellite1 star3)
   added: (pointing satellite1 groundstation7)
   goals met: 0 of 8
6. (take_image satellite2 phenomenon11 instrument4 spectrograph0)
   added: (have_image phenomenon11 spectrograph0)
   goals met: 1 of 8
7. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 1 of 8
8. (calibrate satellite1 instrument2 groundstation7)
   added: (calibrated instrument2)
   goals met: 1 of 8
9. (turn_to satellite1 phenomenon13 groundstation7)
   deleted: (pointing satellite1 groundstation7)
   added: (pointing satellite1 phenomenon13)
   goals met: 1 of 8
10. (take_image satellite1 phenomenon13 instrument2 image1)
   added: (have_image phenomenon13 image1)
   goals met: 2 of 8
11. (turn_to satellite1 planet9 phenomenon13)
   deleted: (pointing satellite1 phenomenon13)
   added: (pointing satellite1 planet9)
   goals met: 2 of 8
12. (take_image satellite1 planet9 instrument2 thermograph3)
   added: (have_image planet9 thermograph3)
   goals met: 3 of 8
13. (turn_to satellite1 star10 planet9)
   deleted: (pointing satellite1 planet9)
   added: (pointing satellite1 star10)
   goals met: 3 of 8
14. (take_image satellite1 star10 instrument2 image1)
   added: (have_image star10 image1)
   goals met: 4 of 8
15. (turn_to satellite1 star12 star10)
   deleted: (pointing satellite1 star10)
   added: (pointing satellite1 star12)
   goals met: 4 of 8
16. (take_image satellite1 star12 instrument2 image1)
   added: (have_image star12 image1)
   goals met: 5 of 8
17. (turn_to satellite1 star16 star12)
   deleted: (pointing satellite1 star12)
   added: (pointing satellite1 star16)
   goals met: 5 of 8
18. (take_image satellite1 star16 instrument2 image1)
   added: (have_image star16 image1)
   goals met: 6 of 8
19. (turn_to satellite2 phenomenon14 phenomenon11)
   deleted: (pointing satellite2 phenomenon11)
   added: (pointing satellite2 phenomenon14)
   goals met: 6 of 8
20. (take_image satellite2 phenomenon14 instrument4 spectrograph0)
   added: (have_image phenomenon14 spectrograph0)
   goals met: 7 of 8
21. (turn_to satellite2 planet15 phenomenon14)
   deleted: (pointing satellite2 phenomenon14)
   added: (pointing satellite2 planet15)
   goals met: 7 of 8
22. (take_image satellite2 planet15 instrument4 spectrograph0)
   added: (have_image planet15 spectrograph0)
   goals met: 8 of 8
